#### LinkLoadContent Members

---

|  |
| --- |
| LinkLoadContent Class   Methods   Properties   See Also |

The  LinkLoadContent  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  ExternalResourceLoadContent  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLinkDataPath | Returns the Link data path owned by this LinkLoadContent object. |
| Public method | GetLinkLoadResult | Retrieves the LinkLoadResult of the attempt to load or reload a Revit link. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetLinkDataPath | Sets the Link data path owned by this LinkLoadContent object. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ExternalResourceLoadContent  .) |
| Public property | LoadStatus | A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method. (Inherited from  ExternalResourceLoadContent  .) |
| Public property | Version | The version of the external data that the server is providing in this object. (Inherited from  ExternalResourceLoadContent  .) |

# See Also

LinkLoadContent Class

Autodesk.Revit.DB Namespace